Catalogs/упТемпературныеРежимы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упТемпературныеРежимы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТемператураОт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемператураДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/упТемпературныеРежимы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Возращает ссылку на температурный режим в указанном диапазоне.  
//
// Параметры:
//  ТемператураОт  - Число - Температура.
//  ТемператураДо  - Число - Температура.
//
// Возвращаемое значение:
//   Число - Результат выполнения.
//
Функция ПолучитьТемпературныйРежим(ТемператураОт, ТемператураДо) Экспорт

	текРезультат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	упТемпературныеРежимы.Ссылка КАК ТемпературныйРежим
	|ИЗ
	|	Справочник.упТемпературныеРежимы КАК упТемпературныеРежимы
	|ГДЕ
	|	упТемпературныеРежимы.ТемператураОт <= &ТемператураОт
	|	И упТемпературныеРежимы.ТемператураДо >= &ТемператураДо";
	Запрос.УстановитьПараметр("ТемператураОт", ТемператураОт);
	Запрос.УстановитьПараметр("ТемператураДо", ТемператураДо);
	текВыборка	= Запрос.Выполнить().Выбрать();
	
	Если текВыборка.Следующий() Тогда
	
		текРезультат = текВыборка.ТемпературныйРежим;
	
	КонецЕсли;
	
	Возврат текРезультат;

КонецФункции // ПолучитьТемпературныйРежим()

#КонецОбласти

#КонецЕсли
